<template>
	<div class="aboutdetails" :class="aboutdetailscls">
			<img :src="imgarr[aboutdetailspid].urlarr" alt="">
			<p class="aboutdetails-text-content">
					{{imgarr[aboutdetailspid].texts}}
			</p>
	</div>
</template>

<script>
  export default {
  name: 'aboutdetails',

data () {
  return {
  	aboutdetailspid:'',
  	imgarr:[
  		{urlarr:require('../img/mdn@2x_01_18_04.jpg')},
  		{urlarr:require('../img/mdn@2x_01_18_05.jpg')},
  		{
  			urlarr:require('../img/mdn@2x_01_18_06.jpg'),
	  		texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
  		},
  		{
  			urlarr:require('../img/mdn@2x_01_18_09.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
  		},
  		{
  			urlarr:require('../img/mdn@2x_01_18_11.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
  		},
  		{urlarr:require('../img/mdn@2x_01_18_12.jpg'),
  		texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
	  	},
  		{urlarr:require('../img/mdn@2x_01_18_14.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
	  	},
  		{urlarr:require('../img/mdn@2x_01_18_16.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
	  	},
  		{urlarr:require('../img/mdn@2x_01_18_18.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
	  	},
  		{urlarr:require('../img/mdn@2x_01_18_20.jpg'),
  			texts:'莫丹娜 MODANNA是由广州莫丹娜服饰有限公司发起创立，是一家集文胸、家居、内裤、保暖、\
	  		美体等为一体的全品类内装产品品牌，主张遵循法式浪漫美学，将艺术性与功能性完美结合，并采用健\
	  		康环保面料，旨在为现代年轻都市女性，呈现一种时尚、放松、品味舒适的生活状态。'
	  	},
	  	{urlarr:require('../img/odb@2x_01_02.jpg')},
  		{urlarr:require('../img/odb@2x_01_03.jpg')},
  		{urlarr:require('../img/odb@2x_01_05.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_07.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_09.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_12.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_14.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_16.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_18.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_20.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_22.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_24.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/odb@2x_01_26.jpg'),
  			texts:"若是普通的品牌，这正是扩展生意的好时机，而OUDBURG（欧德堡）却选择踏踏实实、按部就班的发展，小店升级为大店，将fast-food（快餐）升级fast-casual（休闲），慢慢开出第一家分店、第二家分店……由于开店谨慎，即便在德国，分店数量稀少，排队成为常态。"
  		},
  		{urlarr:require('../img/wlmy@2x_02.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_03.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_02.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_03.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_04.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_06.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_08.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_09.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_10.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_12.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_13.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_14.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_15.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_16.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_17.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/wlmy@2x_01_18.jpg'),
  			texts:"通过梳理乌龙蜜语乌龙茶传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。"
  		},
  		{urlarr:require('../img/pagc@2x_01_03.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_05.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_06.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_08.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_10.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_12.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_14.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_16.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_18.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_19.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_20.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/pagc@2x_01_22.jpg'),
  			texts:'一杯刚刚好的果茶, 一个刚刚好的时代, 一杯有态度的茶, 画册在对外宣传中扮演至关重要的角色，是品牌对外销售、传播品牌形象的最有效载体，有利于品牌形象的传播，提升客户对品牌的认识，'
  		},
  		{urlarr:require('../img/asbd@2x_01_02.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_03.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_04.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_05.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_06.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_07.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_08.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_10.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_12.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
  		{urlarr:require('../img/asbd@2x_01_14.jpg'),texts:'通过梳理项目的定位，结合项目的调性，我们设计了极具少女感的卡通形象，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'
  		},
      {urlarr:require('../img/about@2x_03.jpg'),texts:'WHO WE ARE , 我们是谁 , 服务品牌100+ 走访城市40+ 考察品牌门店3500+ , Service brand 100+ visits city 40+ to inspect brand store 3500+'},
      {urlarr:require('../img/about@2x_04.jpg'),texts:''},
      {urlarr:require('../img/about@2x_05.jpg'),texts:'WHATCAN WEDO, 我们能做什么 , 设计策略/用户体验 /交互设计/品牌体验 , Design strategy / user experience / interaction design / brand experience'},
      {urlarr:require('../img/about@2x_06.jpg'),texts:''},
      {urlarr:require('../img/about@2x_07.jpg'),texts:'WHATIS OURVALUE, 我们的价值观？ 科学 \ 用心 \ 创造 \ 预见 \ 突破 , Science \ Diligence \ Creativity \ Foresight \ Breakthrough'},
      {urlarr:require('../img/about@2x_08.jpg'),texts:''},
      {urlarr:require('../img/xyjs@2x_02.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_03.jpg'),texts:'这是留在大城市的异乡人的共鸣，无论食物多美味，都比不过味蕾对家的记忆。创始人回到湖南，寻遍每一座城市，寻味正宗的湖南味，他想把家乡的味道，带给每一个在外打拼的异乡人。'},
      {urlarr:require('../img/xyjs@2x_05.jpg'),texts:'长沙的剁椒鱼头、湘潭的红烧肉、衡阳的口味金牛蹄……当熟悉的名字、熟悉的菜色、熟悉的味道在视觉、嗅觉、听觉、味觉里绽放，口腹之欲得到满足，才知道无论身处何方，只要有家乡的味道，便是家。'},
      {urlarr:require('../img/xyjs@2x_08.jpg'),texts:'不回顾往昔，不奢求未来，只珍惜当下。创始人想带给食客的湘味，是在疲倦的生活中来碗热腾腾、火辣辣的美食，给奋斗的心一片归属地，吃完饭，精神饱满地去迎接生活吧！\
        这便是湘约今生！'},
      {urlarr:require('../img/xyjs@2x_10.jpg'),texts:'通过梳理湘约今生传达核心商业信息，结合企业文化的精髓，我们设计了极具识别力的标志图形，并以此为基础开发了VI应用系统，统一品牌对外的传播形象。'},
      {urlarr:require('../img/xyjs@2x_12.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_13.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_15.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_16.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_18.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_19.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'},
      {urlarr:require('../img/xyjs@2x_20.jpg'),texts:'和所有雄心勃勃的年轻人一样，大学毕业的创始人留在大城市拼搏，发扬湖南人“耐的烦，霸的蛮”的精神，很快闯出自己的一片天。大城市包容来自全国各地的人，也包容了他们的饮食文化，创始人可以在这里轻易找到湘味美食，却不能找到熟悉的家的味道。'}

  	],
    aboutdetailscls:''
  }

},

methods: {


	getid(){
    if(this.$route.params.id==undefined||null||""){
        this.aboutdetailspid=sessionStorage.pid;
    }else{
      this.aboutdetailspid=this.$route.params.id;
      sessionStorage.setItem("pid",this.aboutdetailspid);
    }
  },

},

mounted () {
    this.aboutdetailscls="aboutdetailscls"
		this.getid();
 },
destroyed() {
    sessionStorage.pid="";
}

}


</script>

